tutorials/cases/flatPlate/flatPlateTemplate/constant/pyrolysisPropertiesStat
pyrolysisPropertiesHotImmediate