tutorials/cases/flatPlate/flatPlateTemplate/constant/reactions
species
(
    N2
    O2
);

reactions
(
);
