tutorials/cases/flatPlate/flatPlateTemplate/system/controlDictHotImmediate
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      binary;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousGasificationFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20.1;

deltaT          0.005;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxDeltaT   0.005;

maxDi   5000;

functions
{
    #includeFunc  writeObjects(thermo:mu,thermo:alpha)
}
// ************************************************************************* //
