tutorials/cases/flatPlate/flatPlateTemplate/system/setFieldsDictStat
setFieldsDictHotImmediate